soap/swad.sendAttendanceEvent.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:swad="urn:swad">
 <SOAP-ENV:Body>
  <swad:sendAttendanceEvent>
   <wsKey></wsKey>
   <attendanceEventCode>0</attendanceEventCode>
   <courseCode>0</courseCode>
   <hidden>0</hidden>
   <startTime>0</startTime>
   <endTime>0</endTime>
   <commentsTeachersVisible>0</commentsTeachersVisible>
   <title></title>
   <text></text>
   <groups></groups>
  </swad:sendAttendanceEvent>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
